cube_buoyantCavity/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;

vertices
(
    (0 0 0)
    (1 0 0)
    (1 1 0)
    (0 1 0)
    (0 0 1)
    (1 0 1)
    (1 1 1)
    (0 1 1)

    (1 0 0)
    (2 0 0)
    (2 1 0)
    (1 1 0)
    (1 0 1)
    (2 0 1)
    (2 1 1)
    (1 1 1)

    (2 0 0)
    (3 0 0)
    (3 1 0)
    (2 1 0)
    (2 0 1)
    (3 0 1)
    (3 1 1)
    (2 1 1)
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (20 20 20) simpleGrading (1 1 1)
    hex (1 9 10 2 5 13 14 6) (20 20 20) simpleGrading (1 1 1)
    hex (9 17 18 10 13 21 22 14) (20 20 20) simpleGrading (1 1 1)
);

boundary
(
    frontAndBack
    {
        type patch;
        faces
        (
            (0 1 2 3)
            (4 5 6 7)
            (1 9 10 2)
            (5 13 14 6)
            (9 17 18 10)
            (13 21 22 14)
        );
    }
    left
    {
        type patch;
        faces
        (
            (0 4 7 3)
        );
    }
    right
    {
        type patch;
        faces
        (
            (18 22 21 17)
        );
    }
    lowerWall
    {
        type wall;
        faces
        (
            (0 1 5 4)
            (1 9 13 5)
            (9 17 21 13)
        );
    }
    upperWall
    {
        type patch;
        faces
        (
            (3 7 6 2)
            (2 6 14 10)
            (10 14 22 18)
        );
    }
);

// ************************************************************************* //
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;

vertices
(
    (0 0 0)
    (1 0 0)
    (1 1 0)
    (0 1 0)
    (0 0 1)
    (1 0 1)
    (1 1 1)
    (0 1 1)

    (1 0 0)
    (2 0 0)
    (2 1 0)
    (1 1 0)
    (1 0 1)
    (2 0 1)
    (2 1 1)
    (1 1 1)

    (2 0 0)
    (3 0 0)
    (3 1 0)
    (2 1 0)
    (2 0 1)
    (3 0 1)
    (3 1 1)
    (2 1 1)
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (20 20 20) simpleGrading (1 1 1)
    hex (1 9 10 2 5 13 14 6) (20 20 20) simpleGrading (1 1 1)
    hex (9 17 18 10 13 21 22 14) (20 20 20) simpleGrading (1 1 1)
);

boundary
(
    frontAndBack
    {
        type patch;
        faces
        (
            (0 1 2 3)
            (4 5 6 7)
            (1 9 10 2)
            (5 13 14 6)
            (9 17 18 10)
            (13 21 22 14)
        );
    }
    left
    {
        type patch;
        faces
        (
            (0 4 7 3)
        );
    }
    right
    {
        type patch;
        faces
        (
            (18 22 21 17)
        );
    }
    lowerWall
    {
        type wall;
        faces
        (
            (0 1 5 4)
            (1 9 13 5)
            (9 17 21 13)
        );
    }
    upperWall
    {
        type patch;
        faces
        (
            (3 7 6 2)
            (2 6 14 10)
            (10 14 22 18)
        );
    }
);

// ************************************************************************* //

