cube_buoyantCavity/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

5
(
    frontAndBack
    {
        type            patch;
        nFaces          2400;
        startFace       69200;
    }
    left
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          400;
        startFace       71600;
    }
    right
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          400;
        startFace       72000;
    }
    lowerWall
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          1200;
        startFace       72400;
    }
    upperWall
    {
        type            patch;
        nFaces          1200;
        startFace       73600;
    }
)

// ************************************************************************* //

