cube_buoyantCavity/0/T
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 1 0 0 0];

internalField   uniform 300;

boundaryField
{
    frontAndBack
    {
        type            zeroGradient;
    }

    left
    {
        type            fixedValue;
        value           uniform 300;
    }

    right
    {
        type            fixedValue;
        value           uniform 300;
    }

    lowerWall
    {
        type            fixedValue;
        value           uniform 300;
    }

    upperWall
    {
        type            fixedValue;
        value           uniform 300;
    }
}

// ************************************************************************* //

