cube_buoyantCavity/0/epsilon
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0";
    object      epsilon;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -3 0 0 0 0];

internalField   uniform 4e-06;

boundaryField
{
    frontAndBack
    {
        type            calculated;
        value           $internalField;
    }

    left
    {
        type            epsilonWallFunction;
        value           uniform 1e-4;
    }

    right
    {
        type            epsilonWallFunction;
        value           uniform 1e-4;
    }

    lowerWall
    {
        type            epsilonWallFunction;
        value           uniform 1e-4;
    }

    upperWall
    {
        type            epsilonWallFunction;
        value           uniform 1e-4;
    }
}

// ************************************************************************* //
